DDN白皮书
--------

## 1.概要
DDN（Data Delivery Network），是新一代数据分发网络。本白皮书描述了DDN的概念和由来，分析了当前互联网存在的问题，整理了DDN想要解决的痛点，提出了具体的解决方案，并从商业层面，提出了未来推进的路线图。

## 2.背景

2015年以来，亿书始终坚守“让有知识的人富起来”这一神圣使命，立足建一个懂感恩的团队，做一个有责任的产品，搭一个国际化的链条，历时2年，积累技术、磨砺产品，先后迭代更新4个大的版本，终于完成了《亿书白皮书》1.0全部需求，初步建立起网络，实现产品落地。
截至今日，亿书成为
第一个提出并践行用区块链进行版权保护的；
第一个提出DDN概念并构建起全分布式网络的；
第一个严格执行白皮书并实现产品落地的；
第一个面向C端用户，走进寻常百姓的；
第一个具备文档、代码、产品和培训全面布局的；
第一个可以进行商用并零成本服务行业的。

## 3.目标
人人都用DDN
-（1）2年内，实现10家规模化企业矩阵链改造或对接，文字、图片、影视资源100万以上，链上资产市值达到100亿以上规模。
-（2）5年内，覆盖行业60%的企业，直接和间接获得5亿用户，链上资产达到万亿规模，让亿书及其衍生产品初步成为人类通往互联网的数据入口。
-（3）10年内，覆盖更多的行业，基本实现互联网底层价值基础。

## 4.技术规划

易用、易学、高性能

-（1）完善分布式算法，不断提高性能。适时引进DAG（有向无环图）技术，让链上交易更加适应大规模、高频次的计算需求。
-（2）完善密码学算法，添加更多场景。提升跨链安全性和易用性，优化侧链技术，添加可视化编码实现，增加物联网使用场景。
-（3）完善使用体验，让产品更加易用、好用。让亿书成为人们日常工作生活的必需品。
-（4）完善分布式存储，提高分布式网络使用体验。进一步优化文件存储协议，提高存储效率和安全性。
-（5）推出内容矿机等硬件设备，提高个人存证安全性。通过硬件补偿，增加更多网络节点，增强DDN网络寻址效率和个人数据存储安全。

## 5.商业布局

让区块链的使用“0”成本

目前，亿书已经在文字、影视、艺术品等领域布置了矩阵链，初步打通了从文字创作、电子出版，到影视版权的全行业布局。
未来，我们将采取技术孵化的模式，进一步加快推进。任何一家从事文化娱乐产业的实体，只要具备优质的资源和较强的运营能力，我们就可以采取如下方式为他们提供技术支持和咨询：
-（1）免费帮助搭建一条与亿书完全一样的底层区块链，完全复制亿书的成功模式；
-（2）锁仓不超过10%DDN作为质押，对应锁仓同比例的新资产作为置换；
-（3）从亿书培训的学员中招募人才组建维护和开发团队，接受亿书团队技术培训，进行业务支持。

更多其他事宜，视需求不同具体商议。

## 6.推广计划

-（1）扩大亿书社区
按照《亿书绿皮书》，凡转发亿书文章、提交代码、撰写有关亿书的文章，为亿书提供有价值的建议，搭建社群宣传亿书等，总之，为亿书做出贡献的，都会直接获得DDN积分奖励（可用来直接消费和购买链上资产）。
-（2）组织行业会议
联合亿书矩阵链的合作企业，共同组织数字出版、作家论坛、影视发布、明星演唱会等各类专业的行业或个性会议，催生更多优质的IP，让链上资产更具价值。
-（3）组织技术研讨
继续区块链茶座、区块链极客论坛等属于亿书的活动品牌，普及区块链知识和理念，传播技术落地的经验，寻找未来技术新方向，打造更多落地应用。
-（4）做好技术培训
亿书已与国内知名的线上培训机构达成战略合作，将对亿书矩阵链、亿书应用等进行系统培训，为行业，特别是矩阵链合作伙伴提供紧缺的区块链研发人才。让亿书培养人才、让人才走进企业、让企业低成本使用区块链。
未来已来，区块链是互联网的未来和未来的互联网，正在悄无声息的改变着你我的生活，让我们共同见证这个伟大的时代！
